#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
google_compute_network.minecraft: Refreshing state... [id=projects/spatial-box-123118/global/networks/minecraft]
google_service_account.minecraft: Refreshing state... [id=projects/spatial-box-123118/serviceAccounts/minecraft@spatial-box-123118.iam.gserviceaccount.com]
google_compute_address.minecraft: Refreshing state... [id=projects/spatial-box-123118/regions/us-east1/addresses/minecraft-ip]
google_compute_disk.minecraft: Refreshing state... [id=projects/spatial-box-123118/zones/us-east1-b/disks/minecraft]
google_compute_resource_policy.backup_policy: Refreshing state... [id=projects/spatial-box-123118/regions/us-east1/resourcePolicies/minecraft-backup-policy]
google_compute_disk_resource_policy_attachment.backup_policy_attachment: Refreshing state... [id=spatial-box-123118/us-east1-b/minecraft/minecraft-backup-policy]
google_compute_firewall.minecraft: Refreshing state... [id=projects/spatial-box-123118/global/firewalls/minecraft]
google_compute_instance_template.minecraft: Refreshing state... [id=projects/spatial-box-123118/global/instanceTemplates/minecraft-template-20210214000042785600000001]
google_compute_instance_group_manager.minecraft: Refreshing state... [id=projects/spatial-box-123118/zones/us-east1-b/instanceGroupManagers/minecraft]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_resource_policy.backup_policy must be replaced
-/+ resource "google_compute_resource_policy" "backup_policy" {
      ~ id        = "projects/spatial-box-123118/regions/us-east1/resourcePolicies/minecraft-backup-policy" -> (known after apply)
        name      = "minecraft-backup-policy"
      ~ project   = "spatial-box-123118" -> (known after apply)
      ~ region    = "https://www.googleapis.com/compute/v1/projects/spatial-box-123118/regions/us-east1" -> "us-east1"
      ~ self_link = "https://www.googleapis.com/compute/v1/projects/spatial-box-123118/regions/us-east1/resourcePolicies/minecraft-backup-policy" -> (known after apply)

      ~ snapshot_schedule_policy {
          ~ retention_policy {
              ~ max_retention_days    = 7 -> 30 # forces replacement
                # (1 unchanged attribute hidden)
            }


          ~ snapshot_properties {
              - guest_flush       = false -> null
              - labels            = {} -> null
                # (1 unchanged attribute hidden)
            }
            # (1 unchanged block hidden)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

------------------------------------------------------------------------

This plan was saved to: terraform.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "terraform.plan"


```
</details>
*Pusher: @davegallant, Action: `pull_request`*